package de.telran.lesson2;

public class HomeworkFirst {
    public static void main(String[] args) {

        //В методе main инициализировать все примитивные типы.
        //Вывести их результат в консоль:
        //char: G
        //int: 89
        //byte: 4
        //short: 56
        //float: 4.7333436
        //double: 4.355453532
        //long: 12121

        char ch = 'G';
        int i = 89;
        byte b = 4;
        short s = 56;
        float f = 4.7333436f;
        double d = 4.355453532;
        long l = 12121;

        System.out.println("char = " + ch + " присвоенное значение");
        System.out.println("int = " + i + " присвоенное значение");
        System.out.println("byte = " + b + " присвоенное значение");
        System.out.println("short = " + s + " присвоенное значение");
        System.out.println("float = " + f + " присвоенное значение");
        System.out.println("double = " + d + " присвоенное значение");
        System.out.println("long = " + l + " присвоенное значение");
    }
}
